Repository: ramaem/AlldeviceConnectorApp
Catalog: Translations/Alldevice Connector.*.xlf
Languages: et_ee

# Table 914479610 - Property 2879900210
source: Alldevice Service Task Lines
et_ee: Alldevice hooldustööde kasutatud varuosade read

# Table 914479610 - Field 3155936699 - Property 2879900210
source: Task Id
et_ee: Hooldustöö Id

# Table 914479610 - Field 446207239 - Property 2879900210
source: Code
et_ee: Kood

# Table 914479610 - Field 402805473 - Property 2879900210
source: Name
et_ee: Nimi

# Table 914479610 - Field 1984130869 - Property 2879900210
source: Quantity
et_ee: Kogus

# Table 1473368314 - Field 1403801591 - Property 2879900210
source: Additional Information
et_ee: Lisainformatsioon

# Table 1473368314 - Field 3815460842 - Property 2879900210
source: Address Prefix
et_ee: URL-i liide

# Table 1473368314 - Field 1909183083 - Property 2879900210
source: API Request Sucess
et_ee: API päring edukas

# Table 1473368314 - Field 138217155 - Property 2879900210
source: Entry Time
et_ee: Kirje sisestuse aeg

# Table 1473368314 - Field 674656825 - Property 2879900210
source: Error From BC
et_ee: Veateade BC-st

# Table 1473368314 - Field 1035366293 - Property 2879900210
source: Response JSON Data
et_ee: Vastuse JSON andmed

# Table 1473368314 - Field 2772723024 - Property 2879900210
source: Sent JSON Data
et_ee: Saadetud JSON andmed

# Table 1473368314 - Field 883711285 - Property 2879900210
source: Entry No.
et_ee: Kirje nr.

# Table 121639522 - Property 2879900210
source: Alldevice API Setup
et_ee: Alldevice API Seadistus

# Table 121639522 - Field 787911642 - Property 2879900210
source: Alldevice API Key
et_ee: Alldevice API Võti

# Table 121639522 - Field 3764346538 - Property 2879900210
source: Alldevice API Password
et_ee: Alldevice API Parool

# Table 121639522 - Field 3203051713 - Property 2879900210
source: Alldevice API Username
et_ee: Alldevice API Kasutajanimi

# Table 121639522 - Field 458362990 - Property 2879900210
source: Get Spare Part Categories List Prefix
et_ee: Varuosa kategooria kogumi ressursi API URL-i liide

# Table 121639522 - Field 1080011069 - Property 2879900210
source: Get Spare Parts Manufacturers List Prefix
et_ee: Varuosa tootja kogumi ressursi API URL-i liide

# Table 121639522 - Field 3983787832 - Property 2879900210
source: Get Service Task List Prefix
et_ee: Hooldustööde kogumi ressursi API URL-i liide

# Table 121639522 - Field 1035744302 - Property 2879900210
source: Get Spare Parts List Prefix
et_ee: Varuosade kogumi ressuri API URL-i liide

# Table 121639522 - Field 966062118 - Property 2879900210
source: Get Used Spares Parts List Prefix
et_ee: Hooldustöödes kasutatud varuosade kogumi ressursi API URL-i liide

# Table 121639522 - Field 894760085 - Property 2879900210
source: Main Spare Part Category
et_ee: Varuosa põhikategooria

# Table 121639522 - Field 2649748049 - Property 2879900210
source: Spare Part Item Template
et_ee: Varuosa mall

# Table 121639522 - Field 3999353247 - Property 2879900210
source: Update or add Spare Part Category
et_ee: Uuenda või lisa uus varuosa kategooria API URL-i liide

# Table 121639522 - Field 3275081431 - Property 2879900210
source: Update or add Spare Part Manufacturer Prefix
et_ee: Uuenda või lisa uus varuosa tootja API URL-i liide

# Table 121639522 - Field 2366524708 - Property 2879900210
source: Update or Add Spare Part
et_ee: Uuenda või lisa varuosa API URL-i liide

# Table 121639522 - Field 1663593181 - Property 2879900210
source: Primary Key
et_ee: Primaarvõti

# Table 114385310 - Property 2879900210
source: Alldevice Posted Tasks
et_ee: Alldevice konteeritud hooldustööd

# Table 114385310 - Field 4111028627 - Property 2879900210
source: Completed Date
et_ee: Lõpetamise kuupäev

# Table 114385310 - Field 3603953603 - Property 2879900210
source: Created On
et_ee: Loodud

# Table 114385310 - Field 2823637353 - Property 2879900210
source: Task Name
et_ee: Hooldustöö nimi

# Table 114385310 - Field 2848317920 - Property 2879900210
source: CPC Device Status
et_ee: Seadme staatus

# Table 114385310 - Field 575102905 - Property 2879900210
source: Is Completed
et_ee: On lõpetatud

# Table 114385310 - Field 3969575869 - Property 2879900210
source: Service Description
et_ee: Hooldustöö kirjeldus

# Table 114385310 - Field 2571788654 - Property 2879900210
source: Service Name
et_ee: Hooldustöö nimi

# Table 114385310 - Field 1557813684 - Property 2879900210
source: Task Id
et_ee: Hooldustöö Id

# Table 114385310 - Field 116342499 - Property 2879900210
source: Task Status
et_ee: Hooldustöö staatus

# Codeunit 3116135017 - NamedType 4221495597
source: Item Category %1 synced to BC
et_ee: Kategooria %1 sünkroniseeritud BC-sse

# Codeunit 3116135017 - NamedType 3813852635
source: Error from Alldevice Categories %1
et_ee: Veateade Alldevice kategooriast %1

# Codeunit 3116135017 - NamedType 2779639592
source: Processing Categories......#1######################\
et_ee: Kategooriate töötlemine......#1######################\

# Codeunit 839849290 - NamedType 263630000
source: Item Manufacturer %1 synced to BC
et_ee: Tootja %1 sünkroniseeriturd BC-sse

# Codeunit 839849290 - NamedType 3422609892
source: Error from Alldevice Manufacturers %1
et_ee: Veateade Alldevice tootjast %1

# Codeunit 839849290 - NamedType 2779639592
source: Processing Manufacturers......#1######################\
et_ee: Tootjate töötlemine......#1######################\

# Codeunit 4057814121 - NamedType 3412708671
source: Item %1 synced to BC
et_ee: Toode %1 sünkroniseeritud BC-sse

# Codeunit 4057814121 - NamedType 1963735664
source: Error from Alldevice Item %1
et_ee: Veateade Alldevice varuosast %1

# Codeunit 4057814121 - NamedType 2779639592
source: Processing Items......#1######################\
et_ee: Varuosade töötlemine......#1######################\

# Codeunit 518769257 - NamedType 2779639592
source: Processing Service Tasks from Alldevice......#1######################\
et_ee: Hooldustööde töötlemine Alldevicest......#1######################\

# Page 1473368314 - Property 2879900210
source: Alldevice API Logs
et_ee: Alldevice API logid

# Page 1473368314 - Action 1466086666 - Property 2879900210
source: View Response JSON
et_ee: Vaata vastuse JSON-i

# Page 1473368314 - Action 3822417819 - Property 2879900210
source: View Sent JSON
et_ee: Vaata saadetud JSON-i

# Page 121639522 - Property 2879900210
source: Alldevice API Setup
et_ee: Alldevice API Seadistus

# Page 121639522 - Control 643899375 - Property 2879900210
source: Entities
et_ee: Olemid

# Page 121639522 - Control 2116949589 - Property 2879900210
source: Service Tasks
et_ee: Hooldustööd

# Page 121639522 - Control 1436843563 - Property 2879900210
source: Spare Parts
et_ee: Varuosad

# Page 121639522 - Control 1303761505 - Property 2879900210
source: Spare Parts Categories
et_ee: Varuosade kategooriad

# Page 121639522 - Control 4147713615 - Property 2879900210
source: Spare Parts Manufacturers
et_ee: Varuosade tootjad

# Page 121639522 - Control 2445482498 - Property 2879900210
source: General
et_ee: Üldine

# Page 121639522 - Action 2774189004 - Property 2879900210
source: Sync Spare Part Categories
et_ee: Sünkroniseeri varuosade kategooriad

# Page 121639522 - Action 3421471526 - Property 2879900210
source: Sync Spare Part Manufacturers
et_ee: Sünkroniseeri varuosade tootjad

# Page 121639522 - Action 3856928140 - Property 2879900210
source: Sync Spare Parts
et_ee: Sünkroniseeri varuosad

# Page 3327184735 - Property 2879900210
source: Alldevice Service Tasks List
et_ee: Alldevice hooldustööd

# Page 3327184735 - Action 2722768050 - Property 2879900210
source: Create Item Jrnl. Lines
et_ee: Moodusta kaubažurnaali read

# Report 1368813719 - Property 2879900210
source: Create Service Task Item Journal Lines
et_ee: Moodusta hooldustööde varusoa kaubažurnaali read

# Report 1368813719 - NamedType 234497962
source: The Posting Date is empty.
et_ee: Konteerimiskuupäev on tühi.

# Report 1368813719 - NamedType 3114637384
source: Item Journal Template name is blank.
et_ee: Kaubažurnaali malli nimi on tühi.

# Report 1368813719 - NamedType 3752334001
source: Item Journal Batch name is blank.
et_ee: Kaubažurnaali partii nimi on tühi.

# Report 1368813719 - Control 2346885236 - Property 2879900210
source: Options
et_ee: Valikud

# Report 1368813719 - Control 1042671269 - Property 2879900210
source: Batch Name
et_ee: Kaubažurnaali tööleht

# Report 1368813719 - Control 1594611733 - Property 2879900210
source: Document Date
et_ee: Dokumendi kuupäev

# Report 1368813719 - Control 3117834186 - Property 2879900210
source: Document No.
et_ee: Dokumendi Nr.

# Report 1368813719 - Control 917963169 - Property 2879900210
source: Entry Type
et_ee: Kirje tüüp

# Report 1368813719 - Control 917963169 - Property 62802879
source: Purchase,Sale,Positive Adjmt.,Negative Adjmt.
et_ee: Ost,Müük,Positive Adjmt.,Negative Adjmt.

# Report 1368813719 - Control 1972515819 - Property 2879900210
source: Journal Template
et_ee: Kaubažurnaali mall

# Report 1368813719 - Control 3037438984 - Property 2879900210
source: Posting Date
et_ee: Konteerimis kuupäev

# Report 1368813719 - Control 3618478127 - Property 2879900210
source: Standard Item Journal
et_ee: Standard kaubažurnaal

# TableExtension 401528010 - Field 2131492872 - Property 2879900210
source: Alldevice Category Id
et_ee: Alldevice kategooria Id

# TableExtension 401528010 - Field 2243818362 - Property 2879900210
source: Last Synced To Alldevice
et_ee: Viimati sünkroniseeritud Alldevice

# TableExtension 987703263 - Field 1195960105 - Property 2879900210
source: Alldevice Product Id
et_ee: Alldevice varuosa Id

# TableExtension 987703263 - Field 1777303464 - Property 2879900210
source: Alldevice Spare
et_ee: Alldevice varuosa

# TableExtension 987703263 - Field 2243818362 - Property 2879900210
source: Last Synced To Alldevice
et_ee: Viimati sünkroniseeritud Alldevice

# TableExtension 2263096497 - Field 1777303464 - Property 2879900210
source: Alldevice Spare
et_ee: Alldevice varuosa

# TableExtension 3538489731 - Field 761019917 - Property 2879900210
source: Alldevice Manufacturer Id
et_ee: Alldevice tootja Id

# TableExtension 3538489731 - Field 2243818362 - Property 2879900210
source: Last Synced To Alldevice
et_ee: Viimati sünkroniseeritud Alldevice
